NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG22/EFR32BG22C222F352GM32.svd
        <register>
          <name>BUF1_WRITEDATA32</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITEDATA32</name>
              <description>Buffer Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF1_XWRITE32</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XORWRITEDATA32</name>
              <description>Buffer XOR Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Buffer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64</name>
                  <description>Sets Buffer size to 64 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128</name>
                  <description>Sets Buffer size to 128 bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256</name>
                  <description>Sets Buffer size to 256 bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512</name>
                  <description>Sets Buffer size to 512 bytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1024</name>
                  <description>Sets Buffer size to 1024 bytes</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2048</name>
                  <description>Sets Buffer size to 2048 bytes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4096</name>
                  <description>Sets Buffer size to 4096 bytes</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_ADDR</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Buffer Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_WRITEOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>WRITEOFFSET</name>
              <description>Write Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_READOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x098</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>READOFFSET</name>
              <description>Read Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_READDATA</name>
          <description>No Description</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>READDATA</name>
              <description>Buffer Read Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_WRITEDATA</name>
          <description>No Description</description>
          <addressOffset>0x0A4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>WRITEDATA</name>
              <description>Buffer Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_XWRITE</name>
          <description>No Description</description>
          <addressOffset>0x0A8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XORWRITEDATA</name>
              <description>Buffer XOR Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_STATUS</name>
          <description>No Description</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01111FFF</resetMask>
          <fields>
            <field>
              <name>BYTES</name>
              <description>Number of Bytes in the Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THRESHOLDFLAG</name>
              <description>Buffer Threshold Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_THRESHOLDCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00002FFF</resetMask>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>Buffer Threshold Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESHOLDMODE</name>
              <description>Buffer Threshold Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LARGER</name>
                  <description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESSOREQUAL</name>
                  <description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_CMD</name>
          <description>No Description</description>
          <addressOffset>0x0B4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Buffer Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_FIFOASYNC</name>
          <description>No Description</description>
          <addressOffset>0x0B8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset ASYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_READDATA32</name>
          <description>No Description</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READDATA32</name>
              <description>Buffer Read Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_WRITEDATA32</name>
          <description>No Description</description>
          <addressOffset>0x0C0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITEDATA32</name>
              <description>Buffer Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2_XWRITE32</name>
          <description>No Description</description>
          <addressOffset>0x0C4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XORWRITEDATA32</name>
              <description>Buffer XOR Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Buffer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64</name>
                  <description>Sets Buffer size to 64 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128</name>
                  <description>Sets Buffer size to 128 bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256</name>
                  <description>Sets Buffer size to 256 bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512</name>
                  <description>Sets Buffer size to 512 bytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1024</name>
                  <description>Sets Buffer size to 1024 bytes</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2048</name>
                  <description>Sets Buffer size to 2048 bytes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4096</name>
                  <description>Sets Buffer size to 4096 bytes</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_ADDR</name>
          <description>No Description</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Buffer Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_WRITEOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>WRITEOFFSET</name>
              <description>Write Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_READOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>READOFFSET</name>
              <description>Read Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_READDATA</name>
          <description>No Description</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>READDATA</name>
              <description>Buffer Read Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_WRITEDATA</name>
          <description>No Description</description>
          <addressOffset>0x0E4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>WRITEDATA</name>
              <description>Buffer Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_XWRITE</name>
          <description>No Description</description>
          <addressOffset>0x0E8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XORWRITEDATA</name>
              <description>Buffer XOR Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_STATUS</name>
          <description>No Description</description>
          <addressOffset>0x0EC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01111FFF</resetMask>
          <fields>
            <field>
              <name>BYTES</name>
              <description>Number of Bytes in the Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THRESHOLDFLAG</name>
              <description>Buffer Threshold Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_THRESHOLDCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00002FFF</resetMask>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>Buffer Threshold Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESHOLDMODE</name>
              <description>Buffer Threshold Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LARGER</name>
                  <description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESSOREQUAL</name>
                  <description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_CMD</name>
          <description>No Description</description>
          <addressOffset>0x0F4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Buffer Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PREFETCH</name>
              <description>Prefetch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_FIFOASYNC</name>
          <description>No Description</description>
          <addressOffset>0x0F8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset ASYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_READDATA32</name>
          <description>No Description</description>
          <addressOffset>0x0FC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READDATA32</name>
              <description>Buffer Read Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_WRITEDATA32</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITEDATA32</name>
              <description>Buffer Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF3_XWRITE32</name>
          <description>No Description</description>
          <addressOffset>0x104</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XORWRITEDATA32</name>
              <description>Buffer XOR Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
