NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG22/EFR32BG22C222F352GM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MODEM_NS</name>
      <version>1</version>
      <description>MODEM_NS Registers</description>
      <baseAddress>0xB8014000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MODEM</name>
        <value>35</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable peripheral clock to this module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF7FF7</resetMask>
          <fields>
            <field>
              <name>DEMODSTATE</name>
              <description>DEMOD state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGSEARCH</name>
                  <description>Timing search</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEARCH</name>
                  <description>Preamble search</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMESEARCH</name>
                  <description>Frame search</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Payload Detection</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMEDETMODE0</name>
                  <description>Timing search with sliding window (FDM0)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMEDETID</name>
              <description>Frame Detected ID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAMEDET0</name>
                  <description>Last frame was detected with sync word defined in SYNC0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMEDET1</name>
                  <description>Last frame was detected with sync word defined in SYNC1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTSEL</name>
              <description>Selected Antenna</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTENNA0</name>
                  <description>Antenna 0 is selected (ANT0 = 1 and ANT1 = 0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTENNA1</name>
                  <description>Antenna 1 is selected (ANT0 = 0 and ANT1 = 1).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMSEQINV</name>
              <description>Timing Sequence Inverted</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMLOSTCAUSE</name>
              <description>Timing Lost Cause</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWCORR</name>
                  <description>Timing lost during Preamble Search or due to low correlation value during Frame Search.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMEOUT</name>
                  <description>Timing lost due to incorrect symbols detected during Frame Search.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSADETECTED</name>
              <description>DSA detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSAFREQESTDONE</name>
              <description>DSA frequency estimation complete</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VITERBIDEMODTIMDET</name>
              <description>Viterbi Demod timing detected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VITERBIDEMODFRAMEDET</name>
              <description>Viterbi Demod frame detected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAMPSTATE</name>
              <description>BLE Viterbi Demod Timing Stamp </description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORR</name>
              <description>Correlation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WEAKSYMBOLS</name>
              <description>Weak symbols</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMDETSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0FFFFF</resetMask>
          <fields>
            <field>
              <name>TIMDETCORR</name>
              <description>Correlation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETFREQOFFEST</name>
              <description>Frequency offset estimate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETPREERRORS</name>
              <description>Preamble errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETPASS</name>
              <description>Timing detection pass</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMDETINDEX</name>
              <description>Timing detection index</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQOFFEST</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>
          <fields>
            <field>
              <name>FREQOFFEST</name>
              <description>Frequency offset estimate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORRVAL</name>
              <description>Correlation value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFTVAL</name>
              <description>Soft detection value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFCADJRX</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>AFCADJRX</name>
              <description>AFC adjustment for RX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFCADJTX</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>AFCADJTX</name>
              <description>AFC adjustment for TX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>ANAMIXMODE</name>
              <description>Analog receiver mixer mode of operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The analog mixer operates in its normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPQPIQSWAP</name>
                  <description>I path is positive, Q path is positive, I and Q are swapped</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPQN</name>
                  <description>I path is positive, Q path is negative</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPQNIQSWAP</name>
                  <description>I path is positive, Q path is negative, I and Q are swapped</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INQP</name>
                  <description>I path is negative, Q path is positive</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INQPIQSWAP</name>
                  <description>I path is negative, Q path is positive, I and Q are swapped</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INQN</name>
                  <description>I path is negative, Q path is negative</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INQNIQSWAP</name>
                  <description>I path is negative, Q path is negative, I and Q are swapped</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPCONVERT</name>
                  <description>Control the analog receiver mixer such that the analog mixer performs a digital up-conversion  on the mixer output, with the frequency set by the DEC0 and CFOSR settings. This mode may be   used to perform RF loopback using the normal synthesizer both for transmit and receive, and   still get a positive IF frequency on the IF receive signal.   </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNCONVERT</name>
                  <description>Control the analog receiver mixer such that the analog mixer performs a digital down-conversion  on the mixer output, with the frequency set by the DEC0 and CFOSR settings.  </description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGIQSWAPEN</name>
              <description>Digital I/Q swap enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
